zurmo_tsung/docker/tsung_sample_config.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="LINK" port="80" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <!--<monitoring>
    <monitor host="myserver" type="snmp"></monitor>
  </monitoring>-->
  
  
  <load duration="10" unit="minute">
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="1" unit="minute">
     <users maxnumber="5"  interarrival="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="2" duration="2" unit="minute">
     <users maxnumber="15"  interarrival="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="3" duration="3" unit="minute">
     <users maxnumber="30"  interarrival="2" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="4" duration="4" unit="minute">
     <users maxnumber="50"  interarrival="2" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <!--<option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>-->
   <option name="thinktime" value="5" random="true" override="true"/>
   <option name="file_server"  id="zurmo_userdb" value="zurmo_userdb.txt"></option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-browse" probability="100" type="ts_http">
      <setdynvars sourcetype="file" fileid="zurmo_userdb" delimiter="," order="iter">
        <var name="user" />
          <var name="user_password" />
    </setdynvars>

    <!-- In the first request I'm putting credentials in the querystring to see what user we're simulating -->    
    <request subst="true"><http url='/zurmo/app/index.php?username=%%_user%%&amp;password=%%_user_password%%&amp;preLogin' version='1.1' method='GET'></http></request>
    
    <thinktime random='true' value='10'/>

    <!-- do login and log if we get a 200 (that would be an auth failure, since successful login gives a 302)-->
    <request subst="true">
        <match do='log' when='nomatch' >302</match>
        <match do='abort' when='nomatch' >302</match>
        <http url='/zurmo/app/index.php/zurmo/default/login' version='1.1'  contents='LoginForm%5Busername%5D=%%_user%%&amp;LoginForm%5Bpassword%5D=%%_user_password%%&amp;LoginForm%5BrememberMe%5D=0&amp;LoginForm%5BrememberMe%5D=1&amp;save=save' content_type='application/x-www-form-urlencoded' method='POST'></http>
    </request>
        
    <thinktime random='true' value='10'/>
    
    <for from="1" to="1000" var="i">
            <request subst="true">
                <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
                <http url='/zurmo/app/index.php?username=%%_user%%&amp;password=%%_user_password%%&amp;postLogin' version='1.1' method='GET'>
            </http></request>
            
        <!-- we get a redirect if it's the first login -->
        <if var="redirect" neq="">
        <!-- follow the redirect -->
          <request subst="true"> <http url="%%_redirect%%"/> </request>
        <!-- confirm timezone with post -->
          <request><http url="/zurmo/app/index.php/users/default/confirmTimeZone" method='POST'
          contents='UserTimeZoneConfirmationForm%5BtimeZone%5D=America/Chicago&amp;save=save'/> </request>
        </if>
        
            
        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/mashableInbox/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/accounts/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/leads/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/contacts/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/opportunities/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/marketing/default/dashboardDetails' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/products/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/products/default/details?id=39&amp;stickyOffset=1' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/products/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/products/default/details?id=22&amp;stickyOffset=6' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/reports/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/reports/default/details?id=3&amp;stickyOffset=2' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/accounts/default' version='1.1' method='GET'></http></request>

        <thinktime random='true' value='10'/>

        <request><http url='/zurmo/app/index.php/mashableInbox/default' version='1.1' method='GET'></http></request>
    </for>

  </session>
 </sessions>
</tsung>